{
  "articles": [
    {
      "id": "1",
      "title": "Cristiano Ronaldo Leads Portugal to UEFA Euro 2024 Victory",
      "content": "Cristiano Ronaldo delivered a historic performance, scoring a hat-trick to lead Portugal to victory in the UEFA Euro 2024 final. His unmatched leadership and precision on the field secured Portugal’s second European Championship title.",
      "author": "Sky Sports",
      "source": "Sky Sports",
      "imageUrl": "https://images.unsplash.com/photo-1521412644187-c49fa049e84d"
    },
    {
      "id": "2",
      "title": "Simone Biles Shatters Records at Paris 2024 Olympics",
      "content": "Simone Biles won four gold medals at the 2024 Summer Olympics in Paris, becoming the most decorated gymnast in history. Her flawless execution and record-breaking routines captivated audiences worldwide.",
      "author": "ESPN Staff",
      "source": "ESPN",
      "imageUrl": "https://images.unsplash.com/photo-1533105079780-92b9be482077"
    },
    {
      "id": "3",
      "title": "Max Verstappen Clinches Third Consecutive F1 Title",
      "content": "Max Verstappen secured his third straight Formula 1 World Championship title after a thrilling victory at the Abu Dhabi Grand Prix, outpacing Lewis Hamilton and Charles Leclerc.",
      "author": "BBC Sport Staff",
      "source": "BBC Sport",
      "imageUrl": "https://images.unsplash.com/photo-1518458028785-8fbcd101ebb9"
    },
    {
      "id": "4",
      "title": "Naomi Osaka Triumphs in US Open Comeback",
      "content": "Naomi Osaka made a stunning return to professional tennis, defeating Iga Swiatek in the 2024 US Open final to claim her fifth Grand Slam title.",
      "author": "The Guardian Sports",
      "source": "The Guardian",
      "imageUrl": "https://images.unsplash.com/photo-1533105079780-92b9be482077"
    },
    {
      "id": "5",
      "title": "Patrick Mahomes Leads Chiefs to Super Bowl LVIII Victory",
      "content": "In a nail-biting Super Bowl LVIII, Patrick Mahomes led the Kansas City Chiefs to a last-minute victory over the San Francisco 49ers with a game-winning touchdown pass.",
      "author": "NFL Network",
      "source": "NFL.com",
      "imageUrl": "https://images.unsplash.com/photo-1504051771394-dd2e66b2e08f"
    },
    {
      "id": "6",
      "title": "Messi and Inter Miami Win Historic MLS Cup",
      "content": "Lionel Messi and Inter Miami completed a dream season by winning the 2024 MLS Cup, marking a historic milestone in American soccer.",
      "author": "FOX Sports",
      "source": "FOX Sports",
      "imageUrl": "https://images.unsplash.com/photo-1521412644187-c49fa049e84d"
    },
    {
      "id": "7",
      "title": "Golden State Warriors Clinch 2024 NBA Championship",
      "content": "The Golden State Warriors secured the 2024 NBA Championship after a thrilling series against the Milwaukee Bucks, led by Stephen Curry’s record-breaking three-pointers.",
      "author": "NBA Insider",
      "source": "NBA.com",
      "imageUrl": "https://images.unsplash.com/photo-1521412644187-c49fa049e84d"
    },
    {
      "id": "8",
      "title": "Rafael Nadal Wins 15th French Open Title",
      "content": "Rafael Nadal made an extraordinary comeback, winning his 15th French Open title at the age of 38 after defeating young sensation Carlos Alcaraz in a thrilling five-set final.",
      "author": "Tennis World",
      "source": "Tennis World USA",
      "imageUrl": "https://images.unsplash.com/photo-1521412644187-c49fa049e84d"
    },
    {
      "id": "9",
      "title": "Tadej Pogačar Claims Third Tour de France Victory",
      "content": "Slovenian cyclist Tadej Pogačar dominated the 2024 Tour de France, securing his third overall victory with an impressive performance in the mountain stages.",
      "author": "Cycling Weekly",
      "source": "Cycling Weekly",
      "imageUrl": "https://images.unsplash.com/photo-1533105079780-92b9be482077"
    },
    {
      "id": "10",
      "title": "Serena Williams Announces Wimbledon 2024 Comeback",
      "content": "Serena Williams confirmed her return to professional tennis, announcing her participation in Wimbledon 2024 after a two-year hiatus.",
      "author": "Reuters Sports",
      "source": "Reuters",
      "imageUrl": "https://images.unsplash.com/photo-1568992687947-868a62a9f521"
    }
  ]
}
